import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})
export class AppComponent {
  list: string[] = [
    '1-21',
    '22-41',
    '42-61',
    '62-81',
    '82-101',
    '102-121',
    '122-141',
    '142-161',
    '162-181',
    '182-201',
    '202-221',
    '222-241',
    '242-261',
    '262-281',
    '282-301',
    '302-321',
    '322-341',
    '342-361',
    '362-381',
    '382-401',
    '402-421',
    '422-441',
    '442-461',
    '462-481',
    '482-501',
    '502-521',
    '522-541',
    '542-561',
    '562-581',
    '582-604'
  ];
  readers: string[] = [
    '1усман Атаги',
    'Дукх-Ваха',
    'Сайд-Эми Атаги',
    'Маьхьди Чечин',
    'Анзор Яхъяев',
    'Муслим Канаев',
    '1усман Цоци-Юрт',
    'Им-Али',
    'Аслан Магамадов',
    'Юша1 Автуры',
    'Зубайр Курчалой',
    'Муслим Грозный',
    'Заурбек Бердикел',
    'Анзор Айдамиров',
    'Ваха-Хьаж',
    'Висхьаж',
    'Абдул-Вахаб',
    'Бувайсар',
    'Увайс',
    'М Висхаж',
    'Аслан Яхъяев',
    'Шамиль',
    'Ваха',
    'Вахита',
    '...?',
    '...?',
    '...?',
    '...?',
    '...?',
    '...?',
  ];
  onClick () {
    return this.readers.unshift(this.readers.pop());
  }
}
